# RailingSystemTopRailHeightParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RailingSystemTopRailHeightParam Property
ParameterTypeId Class See Also
---
"Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RailingSystemTopRailHeightParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingSystemTopRailHeightParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RailingSystemTopRailHeightParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace